import re

texts = [
    "0",
    "0＜剩余时长＜1",
    "1",
    "1＜剩余时长≤500",
    "500＜剩余时长≤1000",
    "1000＜剩余时长≤2000",
    "2000＜剩余时长≤3000",
    "3000＜剩余时长≤4000",
    "4000＜剩余时长≤5000",
    "5000＜剩余时长≤6000",
    "6000＜剩余时长≤7000",
    "7000＜剩余时长≤8000",
    "8000＜剩余时长≤9000",
    "9000＜剩余时长≤10000",
    "10000＜剩余时长≤20000",
    "20000＜剩余时长≤100000",
    "100000＜剩余时长"
]

for text in texts:
    matched = re.findall(r'\d+', text)  # 找出文本中的数字
    for num in matched:
        result = int(num) * 60  # 将数字乘以60
        text = text.replace(num, str(result))  # 替换原文本中的数字为结果
    print(text)
